[
  {
    "name": "BREAKFAST BURRITOS",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2013/06/breakfast-burritos1.jpg",
    "ingredients": " 1/2 batch Golden Skillet, Potatoes, 1-2 teaspoons, oil, 10 large eggs, 1/4 cup milk, 1/2 teaspoon salt, 1/4 teaspoon pepper, 1/2 pound breakfast/bulk sausage ,1 cup chopped fresh spinach, 1 cup shredded cheddar cheese, 6 burrito-size tortillas.",
    "instructions": "Whisk together the eggs, milk, salt and pepper. In a 12-inch nonstick skillet (you can use the same one you used for the potatoes, just transfer the potatoes to a plate and use the skillet as is - no need to wash), heat the oil over medium heat and add the whisked eggs mixture. Cook the eggs over medium heat, stirring often, until soft and scrambled. Remove to a plate. Set the skillet over medium heat again and add the sausage, 1/4 teaspoon salt and pinch of pepper. Cook the sausage, crumbling into bite-sized pieces with a spoon, until no longer pink and cooked through. Drain the grease, if needed (I like to use lean turkey sausage that doesn't have a lot of excess grease). Add the potatoes and eggs back to the skillet along with the spinach. Cook for 1-2 minutes until heated through. Add the cheese and stir until heated through and melted. Add salt and pepper to taste! \n\t\rSpoon the egg mixture into the burritos and roll up burrito-style. Serve immediately with salsa, if desired, or wrap individually in plastic and refrigerate or freeze for an easy breakfast or dinner!"
  },
  {
    "name": "INSTANT POT DOUBLE CHOCOLATE STEEL CUT OATS",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2020/10/choc-steel-cut-oats4.jpg",
    "ingredients": "2 cups milk (almond milk, dairy milk, etc), 3 cups water, 1 cup mashed bananas (about 2-3 medium bananas), 2 cups steel cut oats ,Pinch of salt, 1/2 cup pure maple syrup or honey (see note) ,1 teaspoon vanilla extract ,1/4 cup cocoa powder (natural unsweetened or Dutch-process) ,1/4 to 1/2 cup semisweet or bittersweet chocolate chips. For serving: sliced bananas, raspberries, coconut, chocolate chips, pecans, etc.",
    "instructions": "Grease the insert of a 6-quart Instant Pot or other electric pressure cooker with nonstick cooking spray. To the pot, add the milk, water, bananas, oats and salt. Stir to combine. Secure the lid making sure the valve is sealed. Cook on high pressure for 8 minutes (select manual or pressure cook --> dial the minute setting up or down to get to 8 minutes --> the pressure cooker will start automatically). When the cooking time is done, let the pressure naturally release for 15 minutes before manually releasing the remaining pressure (otherwise liquid may spurt through the valve if pressure is released too soon). Stir in the maple syrup (or honey) and vanilla. Add the cocoa powder and chocolate chips and stir until the chocolate is fully melted. Serve warm with additional milk (if desired), sliced bananas, chopped nuts, shredded coconut, raspberries, chocolate chips, etc. The oatmeal will thicken as it cools, but it makes good leftovers if reheated on low with a bit of milk or water."
  },
  {
    "name": " BROWN BUTTER PECAN GRANOLA",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2019/10/brown-butter-granola8.jpg",
    "ingredients": "1/2 cup butter (I use salted),1/4 cup (1.75 ounces) dark brown sugar, 1/4 cup honey, 2 teaspoons vanilla extract, 1/2 cup (2 ounces) pecans, 2 cups (8 ounces) old-fashioned rolled oats, 1/2 cup (2 to 3 ounces) raw or sprouted pumpkin seeds (pepitas), 1/2 cup (1 ounce) unsweetened or sweetened coconut flakes, 1 teaspoon finely grated orange zest (optional), 1/2 teaspoon ground cinnamon, 1/4 teaspoon coarse, kosher salt, 1/2 cup sweetened dried cranberries (optional)",
    "instructions": "Preheat the oven to 275 degrees F. Line a half sheet pan with parchment paper. Set aside. Over medium heat, melt the butter in a stainless steel skillet or saucepan over medium heat, stirring often, until the butter foams and then browns, 5-6 minutes. Watch carefully so the butter doesn't burn. You just want the itty bitty solids that separate from the butter to turn golden brown. Remove from the heat and stir in the brown sugar, honey, and vanilla. Set aside. In a food processor or high-powered blender, pulse the pecans until finely ground. The texture should be a coarse powder with maybe a few larger pieces here and there. In a large bowl, combine the pecans, oats, pumpkin seeds, coconut, orange zest (if using), cinnamon and salt. Pour the brown butter syrup mixture over the top and stir to combine evenly. Spread the granola into an even layer on the prepared baking sheet. Bake for 60 minutes, stirring every 20 minutes, until the granola smells fragrant and is a nicely toasted golden color. The granola will look wet as you stir and might even look a bit wet coming out of the oven. It will dry as it cools. Let the granola cool completely on the baking sheet. Crumble into pieces and stir in cranberries, if using. Store in an airtight container at room temperature (it will keep well for 1-2 weeks)."
  },
  {
    "name": "PERFECT FLUFFY SOUR CREAM PANCAKES",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/sour-cream-pancakes2.jpg",
    "ingredients": " 3 cups (15 ounces) all-purpose flour (see note about using whole wheat flour), 2 tablespoons granulated sugar, 1 1/2 teaspoons baking powder, 3/4 teaspoon baking soda, 1/2 teaspoon salt, 1 1/2 cups sour cream, 1 1/2 cups milk, 3 large eggs, 6 tablespoons butter, melted ",
    "instructions": "In a large bowl, whisk together the flour, sugar, baking powder, baking soda, and salt. In a separate bowl, whisk together the sour cream, milk, eggs and butter. Add the wet ingredients to the dry and mix with a spoon or spatula until just combined. The batter will be lumpy and it's ok if there are even a few streaks of flour here and there. Don't overmix! The key to light and fluffy pancakes is mixing just until combined. Let the batter rest while prepping the griddle. Heat a nonstick griddle to medium for 1-2 minutes until a drop of water sizzles (about 300 degrees F on my griddle, but every griddle will be a bit different). Pour batter into rounds on the preheated griddle (I use my #20 cookie scoop to portion out the batter which holds about 3-4 tablespoons). Cook until small bubbles appear on the surface and the edges are set, 1-3 minutes, depending on the heat of the griddle. Flip the pancakes and cook for another minute or so until golden and cooked through. Repeat with remaining batter. Serve immediately or keep warm in a 175 degree F oven for 15-20 minutes."
  },
  {
    "name": "CREAMY COCONUT MILK STEEL CUT OATMEAL ",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/coconut-steel-cut-oats1.jpg",
    "ingredients": " 1 can (13.5 ounces) light or regular coconut milk, Water (specific amount in directions below), 2 cups steel cut oats, Pinch of salt, 1/4 cup brown sugar, 1/2 teaspoon vanilla extract. For serving: milk, mini or regular chocolate chips, coconut flakes, chopped almonds",
    "instructions": "Instant Pot Directions: Grease the insert of the Instant Pot with nonstick cooking spray. Pour the can of coconut milk in a 4-cup liquid measuring cup. Add water to reach 4 cups. Pour the mixture into the Instant Pot. Stir in the steel cut oats and salt. Secure the lid and make sure the valve is sealed, select the Manual or Pressure Cook button and dial up or down to 4 minutes. The IP will start automatically. When finished cooking, let the pressure naturally release for 15-20 minutes before manually releasing the remaining pressure. Stir in the brown sugar and vanilla. Serve with additional milk and any extra add-ins (chocolate chips, coconut flakes, almonds). Slow Cooker Directions: Grease the insert of a 5- or 6-quart slow cooker with nonstick cooking spray. Pour the can of coconut milk in a 4-cup liquid measuring cup. Add water to reach 4 cups. Pour the mixture into the slow cooker and add an additional 2 cups water (so that's 6 cups liquid total). Stir in the steel cut oats and salt. Cover the slow cooker and cook on low for 4-5 hours. Stir in the brown sugar and vanilla. Serve with additional milk and any extra add-ins (chocolate chips, coconut flakes, almonds)."
  }
]
