[
  {
    "name": "PEANUT BUTTER CRUNCH SNACK BALLS",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2009/01/DSC02382-copy.jpg",
    "ingredients": "2 cups honey, 6 cups peanut butter (creamy or crunchy), 3 cups rice krispies, 1½ cups grape nuts, 3/4 cup applesauce, 2 cups coconut, 3 cups crushed cereal (I used honey nut cheerios and Life cereal since I had it on hand), 1½ cups chocolate or butterscotch chips – or substitute dried fruit, like raisins, 5-8 tablespoons powdered milk, 4 cups crushed mini-wheat cereal",
    "instructions": "Mix all but last two ingredients and mix until well combined. Add powdered milk, like flour, to make a soft, cookie-like dough. Form into 1” ball and roll in crushed mini-wheats. A scoop works very well for this. Refrigerate or freeze."
  },
  {
    "name": "THE BEST BANANA MUFFINS",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2020/03/banana-muffins15.jpg",
    "ingredients": "2 cups (10 ounces) all-purpose or whole wheat flour, 1 1/2 teaspoons baking powder, 1 teaspoon baking soda, 1 teaspoon ground cinnamon (optional), 1/2 teaspoon salt, 2 to 2 1/4 cups mashed bananas (17-18 ounces, about 4-5 medium bananas), 1 cup (7.5 ounces) light brown sugar, 1/2 cup (4 ounces) melted butter or neutral-flavored oil, 1/4 cup sour cream or plain yogurt, 2 tablespoons milk, 2 large eggs, 1 1/2 cups add-ins (chocolate chips, nuts, etc) ",
    "instructions": "Preheat the oven to 375 degrees F. Line two 12-cup muffin tins with paper liners or lightly grease with cooking spray. In a large bowl, whisk together the flour, baking powder, baking soda, cinnamon and salt. In a medium bowl, whisk together the mashed bananas, brown sugar, melted butter or oil, sour cream, milk and eggs until well-combined. Add the wet ingredients to the dry ingredients and mix with a rubber spatula until just combined and no dry streaks remain. If adding add-ins like chocolate chips, stir them in when there are still a few dry streaks remaining. Don't over mix or the muffins might be tough and dry in texture. Scoop the batter into the prepared muffin tin, filling the muffin cups 2/3 full. Bake for 15-17 minutes until a toothpick inserted in the center comes out clean or with a few moist crumbs and the top of the muffins spring back lightly to the touch. Let cool for 1-2 minutes in the muffin tin before removing to a wire rack to cool completely"
  },
  {
    "name": "EASY HOMEMADE ENGLISH MUFFINS ",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/2020/02/english-muffins9.jpg",
    "ingredients": "1 3/4 cups warm milk or buttermilk (see note), 3 tablespoons butter, melted, 1 1/2 teaspoons salt, 2 tablespoons granulated sugar, 1 tablespoon instant yeast, 1 3/4 cups (8.75 ounces) all-purpose flour, 1 3/4 cups (8.75 ounces) whole wheat flour (see note), 1/2 cup cornmeal. ",
    "instructions": "In a large bowl, mix together the buttermilk, butter, salt, sugar, and yeast. Stir in the flour and mix until well-combined and no dry streaks remain. The batter will be very soft - you can kind of lift it up in a doughy ribbon with a spatula. Cover and let the batter rise in a warm place until puffy and doubled, 1-2 hours. Line two half sheet pans with parchment paper and liberally sprinkle cornmeal over the parchment paper. This will prevent the English muffin dough from sticking. Using a large cookie scoop or two greased spoons, scoop out about 6 tablespoons/2.5 ounces of batter and place in mounds on the prepared baking sheets. *You can make the English muffins larger or smaller depending on preference.* They'll look a little messy at this point; that's ok. Lightly grease your hands and take each mound of batter and flip it over in your hands so it is cornmeal-side up. Gently shape the dough into a mostly smooth round disc and set it back on the baking sheet (sprinkle more cornmeal on the parchment paper, if needed). Space the muffins several inches apart to leave room for rising. Cover the baking sheets and let the muffins rise until noticeably puffy, about an hour. Preheat the oven to 375 degres F. Preheat a griddle to about 325-350 degrees (can also us a skillet on the stove over medium-low or medium heat). Gently pick up the puffy English muffins so they don't totally deflate, and place them on the hot griddle. Cook for about 4-5 minutes per side. Adjust the heat if the English muffins are burning or overly browning. They'll finish cooking all the way through in the oven. Transfer the English muffins to a clean (no cornmeal) parchment lined baking sheet and bake for 5-7 minutes until no longer doughy in the center. Let cool completely (if you can!) before splitting, toasting, and eating."
  },
  {
    "name": "FRUIT SALSA WITH BAKED CINNAMON TORTILLA CHIPS",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/fruit-salsa11.jpg",
    "ingredients": "1 cup small diced Granny Smith, Honeycrisp or Pink Lady apples (about 2 medium or 1 large) 1 cup small diced kiwi fruits (about 2-3 kiwis) 1 cup small diced strawberries (about 6 ounces) 1 cup small diced peaches or nectarines (about 1 large peach/nectarine) 2 tablespoons jam (see note) 2 tablespoons freshly squeezed orange or lemon juice (see note) ",
    "instructions": "For the fruit salsa: Combine the chopped fruit in a serving bowl. In a small bowl or liquid measuring cup, whisk together the jam and orange or lemon juice until combined. Pour the mixture over the fruit and stir to evenly coat the fruit. Serve immediately (although it tastes better if it sits in the refrigerator for an hour or so). For the baked cinnamon tortilla chips: Preheat the oven to 375 degrees F. Line baking sheet(s) with parchment paper. Butter one side of each tortilla with about a teaspoon of butter and sprinkle with cinnamon and sugar all the way to the edges. Stack three or so tortillas on top of each other and cut the stack into 8 triangles with a pizza cutter or knife. Repeat with remaining tortillas. Place the tortilla triangles cinnamon side up in a single layer on the prepared baking sheet(s) and bake for 10-15 minutes until golden. Let cool. Serve alongside the fruit salsa."
  },
  {
    "name": "CHEESY SAUSAGE WONTON BITES",
    "image_source": "https://www.melskitchencafe.com/wp-content/uploads/wonton-sausage-bites4.jpg",
    "ingredients": " 24 wonton wrappers 12 to 16 ounces pork or chicken sausage 1/2 cup small diced green bell pepper (about half of a large bell pepper) 1 cup shredded medium or sharp cheddar cheese 1 1/2 cups shredded Monterey Jack cheese 1 cup ranch or blue cheese dressing ",
    "instructions": "Preheat the oven to 350 degrees F. Press a wonton wrapper into each cup of a mini muffin tin, pressing gently to the bottom and sides. Spray lightly with nonstick cooking spray (optional, but it helps the wrappers brown more in the oven vs staying pale colored). Bake for 6-7 minutes. While the wrappers parbake, heat a nonstick skillet over medium heat and add the sausage and green pepper. Cook, crumbling the sausage into small pieces, until the sausage is no longer pink and cooked through. Drain the grease very well (so the bottom of the wonton bites aren't greasy after baking). Stir in the shredded cheese and ranch (or blue cheese) dressing. Fill the wonton cups evenly with the sausage mixture, pressing to compact the meat mixture just a little into each cup. Bake for 10-15 minutes until the filling is sizzling. Serve warm or at room temperature."
  }
]
